SolarVisionMower/SolarVision/Software/STM32/FSBL/Startup/startup_stm32n645i0hxq_fsbl.s
  .word	WAKEUP_PIN_IRQHandler      			/* Wake-up pin interrupts                                        */
  .word	CTI0_IRQHandler            			/* Debug monitor (Cortex-M55 related)                            */
  .word	CTI1_IRQHandler            			/* Debug monitor (Cortex-M55 related)                            */
  .word	0                          			/* Reserved                                                      */
  .word	LTDC_UP_IRQHandler         			/* LCD up-layer global interrupt                                 */
  .word	LTDC_UP_ERR_IRQHandler     			/* LCD up-layer error interrupt                                  */
  .size g_pfnVectors, .-g_pfnVectors

/*******************************************************************************
*
* Provide weak aliases for each Exception handler to the Default_Handler.
* As they are weak aliases, any function with the same name will override
* this definition.
*
*******************************************************************************/

	.weak	NMI_Handler
	.thumb_set NMI_Handler,Default_Handler

	.weak	HardFault_Handler
	.thumb_set HardFault_Handler,Default_Handler

	.weak	MemManage_Handler
	.thumb_set MemManage_Handler,Default_Handler

	.weak	BusFault_Handler
	.thumb_set BusFault_Handler,Default_Handler

	.weak	UsageFault_Handler
	.thumb_set UsageFault_Handler,Default_Handler

	.weak	SecureFault_Handler
	.thumb_set SecureFault_Handler,Default_Handler

	.weak	SVC_Handler
	.thumb_set SVC_Handler,Default_Handler

	.weak	DebugMon_Handler
	.thumb_set DebugMon_Handler,Default_Handler

	.weak	PendSV_Handler
	.thumb_set PendSV_Handler,Default_Handler

	.weak	SysTick_Handler
	.thumb_set SysTick_Handler,Default_Handler

	.weak	PVD_PVM_IRQHandler
	.thumb_set PVD_PVM_IRQHandler,Default_Handler

	.weak	DTS_IRQHandler
	.thumb_set DTS_IRQHandler,Default_Handler

	.weak	RCC_IRQHandler
	.thumb_set RCC_IRQHandler,Default_Handler

	.weak	LOCKUP_IRQHandler
	.thumb_set LOCKUP_IRQHandler,Default_Handler

	.weak	CACHE_ECC_IRQHandler
	.thumb_set CACHE_ECC_IRQHandler,Default_Handler

	.weak	TCM_ECC_IRQHandler
	.thumb_set TCM_ECC_IRQHandler,Default_Handler

	.weak	BCK_ECC_IRQHandler
	.thumb_set BCK_ECC_IRQHandler,Default_Handler

	.weak	FPU_IRQHandler
	.thumb_set FPU_IRQHandler,Default_Handler

	.weak	RTC_S_IRQHandler
	.thumb_set RTC_S_IRQHandler,Default_Handler

	.weak	TAMP_IRQHandler
	.thumb_set TAMP_IRQHandler,Default_Handler

	.weak	RIFSC_TAMPER_IRQHandler
	.thumb_set RIFSC_TAMPER_IRQHandler,Default_Handler

	.weak	IAC_IRQHandler
	.thumb_set IAC_IRQHandler,Default_Handler

	.weak	RCC_S_IRQHandler
	.thumb_set RCC_S_IRQHandler,Default_Handler

	.weak	RTC_IRQHandler
	.thumb_set RTC_IRQHandler,Default_Handler

	.weak	WDGLS_EARLY_IRQHandler
	.thumb_set WDGLS_EARLY_IRQHandler,Default_Handler

	.weak	WWDG_EARLY_IRQHandler
	.thumb_set WWDG_EARLY_IRQHandler,Default_Handler

	.weak	EXTI0_IRQHandler
	.thumb_set EXTI0_IRQHandler,Default_Handler

	.weak	EXTI1_IRQHandler
	.thumb_set EXTI1_IRQHandler,Default_Handler

	.weak	EXTI2_IRQHandler
	.thumb_set EXTI2_IRQHandler,Default_Handler

	.weak	EXTI3_IRQHandler
	.thumb_set EXTI3_IRQHandler,Default_Handler

	.weak	EXTI4_IRQHandler
	.thumb_set EXTI4_IRQHandler,Default_Handler

	.weak	EXTI5_IRQHandler
	.thumb_set EXTI5_IRQHandler,Default_Handler

	.weak	EXTI6_IRQHandler
	.thumb_set EXTI6_IRQHandler,Default_Handler

	.weak	EXTI7_IRQHandler
	.thumb_set EXTI7_IRQHandler,Default_Handler

	.weak	EXTI8_IRQHandler
	.thumb_set EXTI8_IRQHandler,Default_Handler

	.weak	EXTI9_IRQHandler
	.thumb_set EXTI9_IRQHandler,Default_Handler

	.weak	EXTI10_IRQHandler
	.thumb_set EXTI10_IRQHandler,Default_Handler

	.weak	EXTI11_IRQHandler
	.thumb_set EXTI11_IRQHandler,Default_Handler

	.weak	EXTI12_IRQHandler
	.thumb_set EXTI12_IRQHandler,Default_Handler

	.weak	EXTI13_IRQHandler
	.thumb_set EXTI13_IRQHandler,Default_Handler

	.weak	EXTI14_IRQHandler
	.thumb_set EXTI14_IRQHandler,Default_Handler

	.weak	EXTI15_IRQHandler
	.thumb_set EXTI15_IRQHandler,Default_Handler

	.weak	HASH_IRQHandler
	.thumb_set HASH_IRQHandler,Default_Handler

	.weak	RNG_IRQHandler
	.thumb_set RNG_IRQHandler,Default_Handler

	.weak	ADC12_IRQHandler
	.thumb_set ADC12_IRQHandler,Default_Handler

	.weak	CSI_DBG_IRQHandler
	.thumb_set CSI_DBG_IRQHandler,Default_Handler

	.weak	DCMIPP_IRQHandler
	.thumb_set DCMIPP_IRQHandler,Default_Handler

	.weak	PAHB_ERR_IRQHandler
	.thumb_set PAHB_ERR_IRQHandler,Default_Handler

	.weak	NPU_end_of_epoch_IRQHandler
	.thumb_set NPU_end_of_epoch_IRQHandler,Default_Handler

	.weak	NPU1_IRQHandler
	.thumb_set NPU1_IRQHandler,Default_Handler

	.weak	NPU2_IRQHandler
	.thumb_set NPU2_IRQHandler,Default_Handler

	.weak	NPU3_IRQHandler
	.thumb_set NPU3_IRQHandler,Default_Handler

	.weak	NPUCACHE_IRQHandler
	.thumb_set NPUCACHE_IRQHandler,Default_Handler

	.weak	LTDC_LO_IRQHandler
	.thumb_set LTDC_LO_IRQHandler,Default_Handler

	.weak	LTDC_LO_ERR_IRQHandler
	.thumb_set LTDC_LO_ERR_IRQHandler,Default_Handler

	.weak	DMA2D_IRQHandler
	.thumb_set DMA2D_IRQHandler,Default_Handler

	.weak	JPEG_IRQHandler
	.thumb_set JPEG_IRQHandler,Default_Handler

	.weak	VENC_IRQHandler
	.thumb_set VENC_IRQHandler,Default_Handler

	.weak	GFXMMU_IRQHandler
	.thumb_set GFXMMU_IRQHandler,Default_Handler

	.weak	GFXTIM_IRQHandler
	.thumb_set GFXTIM_IRQHandler,Default_Handler

	.weak	GPU2D_IRQHandler
	.thumb_set GPU2D_IRQHandler,Default_Handler

	.weak	GPU2D_ERROR_IRQHandler
	.thumb_set GPU2D_ERROR_IRQHandler,Default_Handler

	.weak	GPU_CACHE_IRQHandler
	.thumb_set GPU_CACHE_IRQHandler,Default_Handler

	.weak	HPDMA1_CH0_IRQHandler
	.thumb_set HPDMA1_CH0_IRQHandler,Default_Handler

	.weak	HPDMA1_CH1_IRQHandler
	.thumb_set HPDMA1_CH1_IRQHandler,Default_Handler

	.weak	HPDMA1_CH2_IRQHandler
	.thumb_set HPDMA1_CH2_IRQHandler,Default_Handler

	.weak	HPDMA1_CH3_IRQHandler
	.thumb_set HPDMA1_CH3_IRQHandler,Default_Handler

	.weak	HPDMA1_CH4_IRQHandler
	.thumb_set HPDMA1_CH4_IRQHandler,Default_Handler

	.weak	HPDMA1_CH5_IRQHandler
	.thumb_set HPDMA1_CH5_IRQHandler,Default_Handler

	.weak	HPDMA1_CH6_IRQHandler
	.thumb_set HPDMA1_CH6_IRQHandler,Default_Handler

