SolarVisionMower/SolarVision/Software/STM32/FSBL/Startup/startup_stm32n645i0hxq_fsbl.s
	.weak	HPDMA1_CH7_IRQHandler
	.thumb_set HPDMA1_CH7_IRQHandler,Default_Handler

	.weak	HPDMA1_CH8_IRQHandler
	.thumb_set HPDMA1_CH8_IRQHandler,Default_Handler

	.weak	HPDMA1_CH9_IRQHandler
	.thumb_set HPDMA1_CH9_IRQHandler,Default_Handler

	.weak	HPDMA1_CH10_IRQHandler
	.thumb_set HPDMA1_CH10_IRQHandler,Default_Handler

	.weak	HPDMA1_CH11_IRQHandler
	.thumb_set HPDMA1_CH11_IRQHandler,Default_Handler

	.weak	HPDMA1_CH12_IRQHandler
	.thumb_set HPDMA1_CH12_IRQHandler,Default_Handler

	.weak	HPDMA1_CH13_IRQHandler
	.thumb_set HPDMA1_CH13_IRQHandler,Default_Handler

	.weak	HPDMA1_CH14_IRQHandler
	.thumb_set HPDMA1_CH14_IRQHandler,Default_Handler

	.weak	HPDMA1_CH15_IRQHandler
	.thumb_set HPDMA1_CH15_IRQHandler,Default_Handler

	.weak	GPDMA1_CH0_IRQHandler
	.thumb_set GPDMA1_CH0_IRQHandler,Default_Handler

	.weak	GPDMA1_CH1_IRQHandler
	.thumb_set GPDMA1_CH1_IRQHandler,Default_Handler

	.weak	GPDMA1_CH2_IRQHandler
	.thumb_set GPDMA1_CH2_IRQHandler,Default_Handler

	.weak	GPDMA1_CH3_IRQHandler
	.thumb_set GPDMA1_CH3_IRQHandler,Default_Handler

	.weak	GPDMA1_CH4_IRQHandler
	.thumb_set GPDMA1_CH4_IRQHandler,Default_Handler

	.weak	GPDMA1_CH5_IRQHandler
	.thumb_set GPDMA1_CH5_IRQHandler,Default_Handler

	.weak	GPDMA1_CH6_IRQHandler
	.thumb_set GPDMA1_CH6_IRQHandler,Default_Handler

	.weak	GPDMA1_CH7_IRQHandler
	.thumb_set GPDMA1_CH7_IRQHandler,Default_Handler

	.weak	GPDMA1_CH8_IRQHandler
	.thumb_set GPDMA1_CH8_IRQHandler,Default_Handler

	.weak	GPDMA1_CH9_IRQHandler
	.thumb_set GPDMA1_CH9_IRQHandler,Default_Handler

	.weak	GPDMA1_CH10_IRQHandler
	.thumb_set GPDMA1_CH10_IRQHandler,Default_Handler

	.weak	GPDMA1_CH11_IRQHandler
	.thumb_set GPDMA1_CH11_IRQHandler,Default_Handler

	.weak	GPDMA1_CH12_IRQHandler
	.thumb_set GPDMA1_CH12_IRQHandler,Default_Handler

	.weak	GPDMA1_CH13_IRQHandler
	.thumb_set GPDMA1_CH13_IRQHandler,Default_Handler

	.weak	GPDMA1_CH14_IRQHandler
	.thumb_set GPDMA1_CH14_IRQHandler,Default_Handler

	.weak	GPDMA1_CH15_IRQHandler
	.thumb_set GPDMA1_CH15_IRQHandler,Default_Handler

	.weak	I2C1_EV_IRQHandler
	.thumb_set I2C1_EV_IRQHandler,Default_Handler

	.weak	I2C1_ER_IRQHandler
	.thumb_set I2C1_ER_IRQHandler,Default_Handler

	.weak	I2C2_EV_IRQHandler
	.thumb_set I2C2_EV_IRQHandler,Default_Handler

	.weak	I2C2_ER_IRQHandler
	.thumb_set I2C2_ER_IRQHandler,Default_Handler

	.weak	I2C3_EV_IRQHandler
	.thumb_set I2C3_EV_IRQHandler,Default_Handler

	.weak	I2C3_ER_IRQHandler
	.thumb_set I2C3_ER_IRQHandler,Default_Handler

	.weak	I2C4_EV_IRQHandler
	.thumb_set I2C4_EV_IRQHandler,Default_Handler

	.weak	I2C4_ER_IRQHandler
	.thumb_set I2C4_ER_IRQHandler,Default_Handler

	.weak	I3C1_EV_IRQHandler
	.thumb_set I3C1_EV_IRQHandler,Default_Handler

	.weak	I3C1_ER_IRQHandler
	.thumb_set I3C1_ER_IRQHandler,Default_Handler

	.weak	I3C2_EV_IRQHandler
	.thumb_set I3C2_EV_IRQHandler,Default_Handler

	.weak	I3C2_ER_IRQHandler
	.thumb_set I3C2_ER_IRQHandler,Default_Handler

	.weak	TIM1_BRK_IRQHandler
	.thumb_set TIM1_BRK_IRQHandler,Default_Handler

	.weak	TIM1_UP_IRQHandler
	.thumb_set TIM1_UP_IRQHandler,Default_Handler

	.weak	TIM1_TRG_CCU_IRQHandler
	.thumb_set TIM1_TRG_CCU_IRQHandler,Default_Handler

	.weak	TIM1_CC_IRQHandler
	.thumb_set TIM1_CC_IRQHandler,Default_Handler

	.weak	TIM2_IRQHandler
	.thumb_set TIM2_IRQHandler,Default_Handler

	.weak	TIM3_IRQHandler
	.thumb_set TIM3_IRQHandler,Default_Handler

	.weak	TIM4_IRQHandler
	.thumb_set TIM4_IRQHandler,Default_Handler

	.weak	TIM5_IRQHandler
	.thumb_set TIM5_IRQHandler,Default_Handler

	.weak	TIM6_IRQHandler
	.thumb_set TIM6_IRQHandler,Default_Handler

	.weak	TIM7_IRQHandler
	.thumb_set TIM7_IRQHandler,Default_Handler

	.weak	TIM8_BRK_IRQHandler
	.thumb_set TIM8_BRK_IRQHandler,Default_Handler

	.weak	TIM8_UP_IRQHandler
	.thumb_set TIM8_UP_IRQHandler,Default_Handler

	.weak	TIM8_TRG_CCU_IRQHandler
	.thumb_set TIM8_TRG_CCU_IRQHandler,Default_Handler

	.weak	TIM8_CC_IRQHandler
	.thumb_set TIM8_CC_IRQHandler,Default_Handler

	.weak	TIM9_IRQHandler
	.thumb_set TIM9_IRQHandler,Default_Handler

	.weak	TIM10_IRQHandler
	.thumb_set TIM10_IRQHandler,Default_Handler

	.weak	TIM11_IRQHandler
	.thumb_set TIM11_IRQHandler,Default_Handler

	.weak	TIM12_IRQHandler
	.thumb_set TIM12_IRQHandler,Default_Handler

	.weak	TIM13_IRQHandler
	.thumb_set TIM13_IRQHandler,Default_Handler

	.weak	TIM14_IRQHandler
	.thumb_set TIM14_IRQHandler,Default_Handler

	.weak	TIM15_IRQHandler
	.thumb_set TIM15_IRQHandler,Default_Handler

	.weak	TIM16_IRQHandler
	.thumb_set TIM16_IRQHandler,Default_Handler

	.weak	TIM17_IRQHandler
	.thumb_set TIM17_IRQHandler,Default_Handler

	.weak	TIM18_IRQHandler
	.thumb_set TIM18_IRQHandler,Default_Handler

	.weak	LPTIM1_IRQHandler
	.thumb_set LPTIM1_IRQHandler,Default_Handler

	.weak	LPTIM2_IRQHandler
	.thumb_set LPTIM2_IRQHandler,Default_Handler

	.weak	LPTIM3_IRQHandler
	.thumb_set LPTIM3_IRQHandler,Default_Handler

	.weak	LPTIM4_IRQHandler
	.thumb_set LPTIM4_IRQHandler,Default_Handler

	.weak	LPTIM5_IRQHandler
	.thumb_set LPTIM5_IRQHandler,Default_Handler

	.weak	ADF1_FLT0_IRQHandler
	.thumb_set ADF1_FLT0_IRQHandler,Default_Handler

	.weak	MDF1_FLT0_IRQHandler
	.thumb_set MDF1_FLT0_IRQHandler,Default_Handler

	.weak	MDF1_FLT1_IRQHandler
	.thumb_set MDF1_FLT1_IRQHandler,Default_Handler

	.weak	MDF1_FLT2_IRQHandler
	.thumb_set MDF1_FLT2_IRQHandler,Default_Handler

	.weak	MDF1_FLT3_IRQHandler
	.thumb_set MDF1_FLT3_IRQHandler,Default_Handler

	.weak	MDF1_FLT4_IRQHandler
	.thumb_set MDF1_FLT4_IRQHandler,Default_Handler

	.weak	MDF1_FLT5_IRQHandler
	.thumb_set MDF1_FLT5_IRQHandler,Default_Handler

	.weak	SAI1_A_IRQHandler
	.thumb_set SAI1_A_IRQHandler,Default_Handler

	.weak	SAI1_B_IRQHandler
	.thumb_set SAI1_B_IRQHandler,Default_Handler

	.weak	SAI2_A_IRQHandler
	.thumb_set SAI2_A_IRQHandler,Default_Handler

	.weak	SAI2_B_IRQHandler
	.thumb_set SAI2_B_IRQHandler,Default_Handler

	.weak	SPDIFRX_IRQHandler
	.thumb_set SPDIFRX_IRQHandler,Default_Handler

	.weak	SPI1_IRQHandler
	.thumb_set SPI1_IRQHandler,Default_Handler

	.weak	SPI2_IRQHandler
	.thumb_set SPI2_IRQHandler,Default_Handler

	.weak	SPI3_IRQHandler
	.thumb_set SPI3_IRQHandler,Default_Handler

