SolarVisionMower/SolarVision/Software/STM32/FSBL/Startup/startup_stm32n645i0hxq_fsbl.s
	.weak	SPI4_IRQHandler
	.thumb_set SPI4_IRQHandler,Default_Handler

	.weak	SPI5_IRQHandler
	.thumb_set SPI5_IRQHandler,Default_Handler

	.weak	SPI6_IRQHandler
	.thumb_set SPI6_IRQHandler,Default_Handler

	.weak	USART1_IRQHandler
	.thumb_set USART1_IRQHandler,Default_Handler

	.weak	USART2_IRQHandler
	.thumb_set USART2_IRQHandler,Default_Handler

	.weak	USART3_IRQHandler
	.thumb_set USART3_IRQHandler,Default_Handler

	.weak	UART4_IRQHandler
	.thumb_set UART4_IRQHandler,Default_Handler

	.weak	UART5_IRQHandler
	.thumb_set UART5_IRQHandler,Default_Handler

	.weak	USART6_IRQHandler
	.thumb_set USART6_IRQHandler,Default_Handler

	.weak	UART7_IRQHandler
	.thumb_set UART7_IRQHandler,Default_Handler

	.weak	UART8_IRQHandler
	.thumb_set UART8_IRQHandler,Default_Handler

	.weak	UART9_IRQHandler
	.thumb_set UART9_IRQHandler,Default_Handler

	.weak	USART10_IRQHandler
	.thumb_set USART10_IRQHandler,Default_Handler

	.weak	LPUART1_IRQHandler
	.thumb_set LPUART1_IRQHandler,Default_Handler

	.weak	XSPI1_IRQHandler
	.thumb_set XSPI1_IRQHandler,Default_Handler

	.weak	XSPI2_IRQHandler
	.thumb_set XSPI2_IRQHandler,Default_Handler

	.weak	XSPI3_IRQHandler
	.thumb_set XSPI3_IRQHandler,Default_Handler

	.weak	FMC_IRQHandler
	.thumb_set FMC_IRQHandler,Default_Handler

	.weak	SDMMC1_IRQHandler
	.thumb_set SDMMC1_IRQHandler,Default_Handler

	.weak	SDMMC2_IRQHandler
	.thumb_set SDMMC2_IRQHandler,Default_Handler

	.weak	UCPD_IRQHandler
	.thumb_set UCPD_IRQHandler,Default_Handler

	.weak	OTG1_IRQHandler
	.thumb_set OTG1_IRQHandler,Default_Handler

	.weak	OTG2_IRQHandler
	.thumb_set OTG2_IRQHandler,Default_Handler

	.weak	ETH1_IRQHandler
	.thumb_set ETH1_IRQHandler,Default_Handler

	.weak	FDCAN1_IT0_IRQHandler
	.thumb_set FDCAN1_IT0_IRQHandler,Default_Handler

	.weak	FDCAN1_IT1_IRQHandler
	.thumb_set FDCAN1_IT1_IRQHandler,Default_Handler

	.weak	FDCAN2_IT0_IRQHandler
	.thumb_set FDCAN2_IT0_IRQHandler,Default_Handler

	.weak	FDCAN2_IT1_IRQHandler
	.thumb_set FDCAN2_IT1_IRQHandler,Default_Handler

	.weak	FDCAN3_IT0_IRQHandler
	.thumb_set FDCAN3_IT0_IRQHandler,Default_Handler

	.weak	FDCAN3_IT1_IRQHandler
	.thumb_set FDCAN3_IT1_IRQHandler,Default_Handler

	.weak	FDCAN_CU_IRQHandler
	.thumb_set FDCAN_CU_IRQHandler,Default_Handler

	.weak	MDIOS_IRQHandler
	.thumb_set MDIOS_IRQHandler,Default_Handler

	.weak	DCMI_PSSI_IRQHandler
	.thumb_set DCMI_PSSI_IRQHandler,Default_Handler

	.weak	WAKEUP_PIN_IRQHandler
	.thumb_set WAKEUP_PIN_IRQHandler,Default_Handler

	.weak	CTI0_IRQHandler
	.thumb_set CTI0_IRQHandler,Default_Handler

	.weak	CTI1_IRQHandler
	.thumb_set CTI1_IRQHandler,Default_Handler

	.weak	LTDC_UP_IRQHandler
	.thumb_set LTDC_UP_IRQHandler,Default_Handler

	.weak	LTDC_UP_ERR_IRQHandler
	.thumb_set LTDC_UP_ERR_IRQHandler,Default_Handler

	.weak	SystemInit

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
